src/cf/Catalogs/уатРабочиеСтолы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатРабочиеСтолы</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПанелей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Панель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОтчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатРабочиеСтолы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.Карта;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.КартаПункты;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	Панели.Панель3 = "Пункты";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);

	ТекЭлемент = Справочники.уатРабочиеСтолы.КартаСобытия;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	Панели.Панель3 = "События";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.НайтиПоНаименованию("Карта + Отчет ""Анализ план факта по Заказам""",Истина);
	Если ТекЭлемент.ПометкаУдаления Тогда
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		СпрОбъект.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет поля элемента справочника "уатРабочиеСтолы"
//
Процедура ЗаполнитьРабочиеСтолы(РабочийСтол, Знач Назначение, Знач Панели)
	
	СпрОбъект = РабочийСтол.ПолучитьОбъект();
	СпрОбъект.Назначение = Назначение;
	СпрОбъект.НастройкиПанелей.Очистить();
	Для Счетчик = 1 По 4 Цикл
		НоваяСтрока = СпрОбъект.НастройкиПанелей.Добавить();
		НаименованиеПанели = "Панель" + Счетчик;
		НоваяСтрока.Панель   = НаименованиеПанели;
		Если Панели.Свойство(НаименованиеПанели) И ЗначениеЗаполнено(Панели[НаименованиеПанели]) Тогда
			Если ТипЗнч(Панели[НаименованиеПанели]) = Тип("Структура") Тогда
				НоваяСтрока.Значение      = Панели[НаименованиеПанели].Значение;
				НоваяСтрока.СсылкаНаОтчет = Панели[НаименованиеПанели].СсылкаНаОтчет;
			Иначе
				НоваяСтрока.Значение = Панели[НаименованиеПанели];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
